In [1]:
import pandas as pd

In [36]:
movies = pd.DataFrame({
    "movie_id": [1, 2, 3],
    "title": ["Avengers", "Frozen 2", "Joker"]
})

# Users table
users = pd.DataFrame({
    "user_id": [1, 2, 3, 4],
    "name": ["Daniel", "Monica", "Maria", "James"]
})

# MovieRating table
ratings = pd.DataFrame({
    "movie_id": [1,1,1,1,2,2,3,3,3],
    "user_id":  [1,2,3,4,1,2,1,2,3],
    "rating":   [3,4,2,1,5,2,2,3,4],
    "created_at": pd.to_datetime([
        "2020-01-12","2020-02-11","2020-02-12","2020-01-01",
        "2020-02-17","2020-02-01","2020-03-01","2020-02-22","2020-02-25"
    ])
})

In [37]:
join1 = ratings.merge(movies, on = "movie_id", how = "left")
join1

   movie_id  user_id  rating created_at     title
0         1        1       3 2020-01-12  Avengers
1         1        2       4 2020-02-11  Avengers
2         1        3       2 2020-02-12  Avengers
3         1        4       1 2020-01-01  Avengers
4         2        1       5 2020-02-17  Frozen 2
5         2        2       2 2020-02-01  Frozen 2
6         3        1       2 2020-03-01     Joker
7         3        2       3 2020-02-22     Joker
8         3        3       4 2020-02-25     Joker

In [38]:
join2 = join1.merge(users, on = "user_id", how = "left")
join2

   movie_id  user_id  rating created_at     title    name
0         1        1       3 2020-01-12  Avengers  Daniel
1         1        2       4 2020-02-11  Avengers  Monica
2         1        3       2 2020-02-12  Avengers   Maria
3         1        4       1 2020-01-01  Avengers   James
4         2        1       5 2020-02-17  Frozen 2  Daniel
5         2        2       2 2020-02-01  Frozen 2  Monica
6         3        1       2 2020-03-01     Joker  Daniel
7         3        2       3 2020-02-22     Joker  Monica
8         3        3       4 2020-02-25     Joker   Maria

In [39]:
counted = join2.groupby(by = "name", as_index = False).size().sort_values(['size','name'], ascending = [False, True])
counted

     name  size
0  Daniel     3
3  Monica     3
2   Maria     2
1   James     1

In [40]:
counted['name'][0]

'Daniel'

In [41]:
join2

   movie_id  user_id  rating created_at     title    name
0         1        1       3 2020-01-12  Avengers  Daniel
1         1        2       4 2020-02-11  Avengers  Monica
2         1        3       2 2020-02-12  Avengers   Maria
3         1        4       1 2020-01-01  Avengers   James
4         2        1       5 2020-02-17  Frozen 2  Daniel
5         2        2       2 2020-02-01  Frozen 2  Monica
6         3        1       2 2020-03-01     Joker  Daniel
7         3        2       3 2020-02-22     Joker  Monica
8         3        3       4 2020-02-25     Joker   Maria

In [42]:
mask = join2['created_at'].dt.to_period("M") == "2020-02"
feb = join2[mask]
feb

   movie_id  user_id  rating created_at     title    name
1         1        2       4 2020-02-11  Avengers  Monica
2         1        3       2 2020-02-12  Avengers   Maria
4         2        1       5 2020-02-17  Frozen 2  Daniel
5         2        2       2 2020-02-01  Frozen 2  Monica
7         3        2       3 2020-02-22     Joker  Monica
8         3        3       4 2020-02-25     Joker   Maria

In [45]:
feb.groupby(by = "title", as_index = False)['rating'].mean().sort_values(['rating', 'title'], ascending = [False, True])

      title  rating
1  Frozen 2     3.5
2     Joker     3.5
0  Avengers     3.0

In [53]:
my_numbers = pd.DataFrame({
    "num": [8, 8, 3, 3, 1, 4]
})

In [54]:
df = my_numbers.groupby(by = "num", as_index = False).size()
df

   num  size
0    1     1
1    3     2
2    4     1
3    8     2

In [55]:
df.size

8

In [56]:
mask = (df['size'] == 1)
mask

0     True
1    False
2     True
3    False
Name: size, dtype: bool

In [58]:
if mask.any() == False:
    print(pd.DataFrame({'num': [None]}))

In [16]:
new = df[mask][['num']]
new

   num
0    1
2    4
3    5
4    6

In [19]:
maxi = max(new.num)

In [24]:
mask2 = (new.num == maxi)
mask2

0    False
2    False
3    False
4     True
Name: num, dtype: bool

In [26]:
new[mask2]

   num
4    6

In [8]:
users = pd.DataFrame({
    "id": [1, 2, 3, 19],
    "name": ["Alice", "Bob", "Alex", "Alice"]
})

rides = pd.DataFrame({
    "id": [1, 2, 3, 4, 5, 9],
    "user_id": [1, 2, 3, 7, 13, 7],
    "distance": [120, 317, 222, 100, 312, 230]
})

In [50]:
users = pd.DataFrame({
    "id": [1, 2, 3, 4, 7, 13, 19],
    "name": ["Alice", "Bob", "Alex", "Donald", "Lee", "Jonathan", "Elvis"]
})

rides = pd.DataFrame({
    "id": [1, 2, 3, 4, 5, 6, 7, 8, 9],
    "user_id": [1, 2, 3, 7, 13, 19, 7, 19, 7],
    "distance": [120, 317, 222, 100, 312, 50, 120, 400, 230]
})

In [51]:
users

   id      name
0   1     Alice
1   2       Bob
2   3      Alex
3   4    Donald
4   7       Lee
5  13  Jonathan
6  19     Elvis

In [52]:
rides

   id  user_id  distance
0   1        1       120
1   2        2       317
2   3        3       222
3   4        7       100
4   5       13       312
5   6       19        50
6   7        7       120
7   8       19       400
8   9        7       230

In [65]:
df = users.merge(rides, left_on = "id", right_on = "user_id", how = "left").fillna(0)
df

   id_x      name  id_y  user_id  distance
0     1     Alice   1.0      1.0     120.0
1     2       Bob   2.0      2.0     317.0
2     3      Alex   3.0      3.0     222.0
3     4    Donald   0.0      0.0       0.0
4     7       Lee   4.0      7.0     100.0
5     7       Lee   7.0      7.0     120.0
6     7       Lee   9.0      7.0     230.0
7    13  Jonathan   5.0     13.0     312.0
8    19     Elvis   6.0     19.0      50.0
9    19     Elvis   8.0     19.0     400.0

In [66]:
df = df.groupby(by = ["id_x", "name"], as_index = False)['distance'].sum()
df

   id_x      name  distance
0     1     Alice     120.0
1     2       Bob     317.0
2     3      Alex     222.0
3     4    Donald       0.0
4     7       Lee     450.0
5    13  Jonathan     312.0
6    19     Elvis     450.0

In [67]:
df = df.rename(columns = {"distance": "travelled_distance"})

df.sort_values(['travelled_distance'], ascending = False)

   id_x      name  travelled_distance
4     7       Lee               450.0
6    19     Elvis               450.0
1     2       Bob               317.0
5    13  Jonathan               312.0
2     3      Alex               222.0
0     1     Alice               120.0
3     4    Donald                 0.0

In [160]:
import pandas as pd

trips = pd.DataFrame({
    "id": [1,2,3,4,5,6,7,8,9,10],
    "client_id": [1,2,3,4,1,2,3,2,3,4],
    "driver_id": [10,11,12,13,10,11,12,12,10,13],
    "city_id": [1,1,6,6,1,6,12,12,12,12],
    "status": [
        "completed", "cancelled_by_driver", "completed", "cancelled_by_client",
        "completed", "completed", "completed", "completed", "completed", "cancelled_by_driver"
    ],
    "request_at": [
        "2013-10-01","2013-10-01","2013-10-01","2013-10-01",
        "2013-10-02","2013-10-02","2013-10-02",
        "2013-10-03","2013-10-03","2013-10-03"
    ]
})

trips["request_at"] = pd.to_datetime(trips["request_at"])
trips

   id  client_id  driver_id  city_id               status request_at
0   1          1         10        1            completed 2013-10-01
1   2          2         11        1  cancelled_by_driver 2013-10-01
2   3          3         12        6            completed 2013-10-01
3   4          4         13        6  cancelled_by_client 2013-10-01
4   5          1         10        1            completed 2013-10-02
5   6          2         11        6            completed 2013-10-02
6   7          3         12       12            completed 2013-10-02
7   8          2         12       12            completed 2013-10-03
8   9          3         10       12            completed 2013-10-03
9  10          4         13       12  cancelled_by_driver 2013-10-03

In [98]:
users = pd.DataFrame({
    "users_id": [1,2,3,4,10,11,12,13],
    "banned": ["No","Yes","No","No","No","No","No","No"],
    "role": ["client","client","client","client","driver","driver","driver","driver"]
})

users

   users_id banned    role
0         1     No  client
1         2    Yes  client
2         3     No  client
3         4     No  client
4        10     No  driver
5        11     No  driver
6        12     No  driver
7        13     No  driver

In [99]:
mask = (users.role == "client")

In [100]:
clients = users[mask]
clients

   users_id banned    role
0         1     No  client
1         2    Yes  client
2         3     No  client
3         4     No  client

In [105]:
merged1 = pd.merge(trips, clients, left_on = "client_id", right_on = "users_id", how = "left")
merged1

,id,client_id,driver_id,city_id,status,request_at,users_id,banned,role
0,1,1,10,1,completed,2013-10-01,1,No,client
1,2,2,11,1,cancelled_by_driver,2013-10-01,2,Yes,client
2,3,3,12,6,completed,2013-10-01,3,No,client
3,4,4,13,6,cancelled_by_client,2013-10-01,4,No,client
4,5,1,10,1,completed,2013-10-02,1,No,client
5,6,2,11,6,completed,2013-10-02,2,Yes,client
6,7,3,12,12,completed,2013-10-02,3,No,client
7,8,2,12,12,completed,2013-10-03,2,Yes,client
8,9,3,10,12,completed,2013-10-03,3,No,client
9,10,4,13,12,cancelled_by_driver,2013-10-03,4,No,client

In [106]:
mask = (users.role == "driver")

In [107]:
drivers = users[mask]
drivers

   users_id banned    role
4        10     No  driver
5        11     No  driver
6        12     No  driver
7        13     No  driver

In [110]:
merged2 = pd.merge(merged1, drivers, left_on = "driver_id", right_on = "users_id", how = "left", suffixes=("_client", "_driver"))
merged2

,id,client_id,driver_id,city_id,status,request_at,users_id_client,banned_client,role_client,users_id_driver,banned_driver,role_driver
0,1,1,10,1,completed,2013-10-01,1,No,client,10,No,driver
1,2,2,11,1,cancelled_by_driver,2013-10-01,2,Yes,client,11,No,driver
2,3,3,12,6,completed,2013-10-01,3,No,client,12,No,driver
3,4,4,13,6,cancelled_by_client,2013-10-01,4,No,client,13,No,driver
4,5,1,10,1,completed,2013-10-02,1,No,client,10,No,driver
5,6,2,11,6,completed,2013-10-02,2,Yes,client,11,No,driver
6,7,3,12,12,completed,2013-10-02,3,No,client,12,No,driver
7,8,2,12,12,completed,2013-10-03,2,Yes,client,12,No,driver
8,9,3,10,12,completed,2013-10-03,3,No,client,10,No,driver
9,10,4,13,12,cancelled_by_driver,2013-10-03,4,No,client,13,No,driver

In [152]:
df = merged2.groupby(by = "request_at").apply(lambda x: ((x["status"].str.startswith("cancelled")) & (x["banned_client"] == "No")).sum()/x["banned_client"].str.startswith("No").sum()).rename("Cancellation Rate").reset_index()
df

  request_at  Cancellation Rate
0 2013-10-01           0.333333
1 2013-10-02           0.000000
2 2013-10-03           0.500000

In [153]:
df = df.rename(columns = {"request_at":"Day"})
df

         Day  Cancellation Rate
0 2013-10-01           0.333333
1 2013-10-02           0.000000
2 2013-10-03           0.500000

In [154]:
df["Cancellation Rate"] = round(df["Cancellation Rate"], 2)
df

         Day  Cancellation Rate
0 2013-10-01               0.33
1 2013-10-02               0.00
2 2013-10-03               0.50

In [162]:
import pandas as pd

mask = (
    (trips.request_at > pd.to_datetime("2013-10-01")) &
    (trips.request_at < pd.to_datetime("2013-10-03"))
)

if mask.any():
    print("Yes")

Yes